app/controllers/contacts_controller.rb

INSERT INTO "contacts" ("nameF", "nameL", "email", "phone", "note", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @contact = Contact.new(contact_params)

    respond_to do |format|
      if @contact.save

UPDATE "contacts" SET "phone" = $1, "updated_at" = $2 WHERE "contacts"."id" = $3  [["phone", "12345678911111"], ["updated_at", "2018-07-05 03:11:43.236928"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @contact.update(contact_params)